---
template: overrides/blogs.html
tags:
  - knowledge graph
---

# Neo4J图数据库反欺诈分析实战（三） - 识别犯罪团伙

!!! info
    Author:：[Vincent](https://github.com/Realvincentyuan)，Posted on 2021-06-06，Reading time: 6 mins，WeChat Post Link:：[:fontawesome-solid-link:](https://mp.weixin.qq.com/s?__biz=MzI4Mjk3NzgxOQ==&mid=2247485261&idx=1&sn=9bbe4e099d7e199d749540797e82e443&chksm=eb90f439dce77d2fb5a8f06707844f0eef22667821f97d9e509563a36cebb2ed1903994056dd&token=1481538225&lang=zh_CN#rd)

## 1 Introduction


Last time
[NEO4J diagram database anti -fraud analysis actual combat (2) -Fore preparation data] (https://mp.weixin.qq.com/s ?__biz=mzi4mjk3ngxoq===2247485256&IDX=1&A1D090982F85F3D2395 372c8ed & chksm = EB90F43CDCE77D2AF75E6313E945A83F230974E7E7E7E7E0855C99D9ECECE6F3D24F3AD06AE80A4 & Token = 771475859 & LANG = zh_cn#RDCure
Among them, the author introduced how to import the data into the NEO4J analysis platform and did some simple descriptive analysis on customers and transaction information. NextNumber, etc.) and many other accounts are intertwined, so you can find clues through these shared information.


## 2 Share identity information


In the previous section, the relationship between the customer and the entity has been defined, such as the customer has emails, telephones, SSN, etc. If multiple customers use the same information, these contacts can ensure that they are connected.Greatly helped us deconstruct complex relationships.However, if you want to run a specific diagram algorithm, you need to deal with these relationships, because the diagram structures applied to the diagram algorithm are different. Some algorithms are suitable for the diagram of the `` `` all in the graph.There is only the same relationship.Some algorithms are suitable for the diagram of the heterogeneity, which contains multiple types of nodes and relationships.


The example provided by NEO4J is used
[弱连接分量（Weakly Connected Components）](https://neo4j.com/docs/graph-data-science/current/algorithms/wcc/ 'Weakly Connected Components')
The algorithm finds the node connected in the unruly graph. This algorithm is suitable for the same composition, so it is necessary to create a new relationship-`Shared_Identifiers` to calculate the number of physical information shared between each customer, such as the email of Customer A and BThe same as SSN, then the attributes of shared_identifiers are 3.


```sql
// Create Shared_identifiers Relations
MATCH (c1:Client)-[:HAS_EMAIL|:HAS_PHONE|:HAS_SSN]->(info)
<-[:HAS_EMAIL|:HAS_PHONE|:HAS_SSN]-(c2:Client)
WHERE c1.id<>c2.id
WITH c1, c2, count(*) as cnt
MERGE (c1) - [:SHARED_IDENTIFIERS {count: cnt}] - (c2);
```


In the command, the keywords of the `with` can connect the query statement together, so that the last step variables are continued to be used in the next step.The use of the keywords of `Merge` is very wide. In general, it can make a model exist in the figure. If the mode does not exist, that is, the new model is created, which is used here to create a relationship.Please note that the amount of data in the example is small, only 300,000 nodes. If the number of nodes is huge, it is recommended to use NEO4J provided
[APOC](https://neo4j.com/labs/apoc/4.2/overview/apoc.periodic/apoc.periodic.iterate/ 'apoc.periodic.iterate')
Methods to perform operations in batches.


## 3 Create a picture


Before running any algorithm, you must first create a picture. You can use the `Shared_IDENTIFIERS` Relationship to build the previously created and map it to the memory. ThereforeThe


```sql
CALL gds.graph.create.cypher.estimate(
'MATCH (c:Client) RETURN id(c) AS id',
'MATCH (c1:Client)-[r:SHARED_IDENTIFIERS]-(c2:Client)
WHERE c1.id<>c2.id
RETURN id(c1) AS source,id(c2) AS target,r.count AS weight')
YIELD requiredMemory,nodeCount,relationshipCount;
```


The output is:


| requiredMemory | nodeCount | relationshipCount |
|---|---|---|
|"8804 CIB" |2433 |1517 |


Make sure that the memory is sufficient to formally create a picture:


```sql
CALL gds.graph.create('WCC', 'Client',
{
SHARED_IDENTIFIERS:{
type: 'SHARED_IDENTIFIERS',
properties: {
count: {
property: 'count'
}
}
}
}
) YIELD graphName,nodeCount,relationshipCount,createMillis;
```


If it runs normally, you can use the `call gds.graph.list ();` command to view the created diagram.


## 4 execute WCC algorithm clustering class


Similarly, it is recommended to estimate the memory resources before performing the algorithm, but it will not be repeated here. Run the WCC to use the following commands.`Set` instructions can give the value to a new attribute. Here is a label for the cluster where the customer is located. It can be seen that the code has excluded the situation where there is only one customer in the cluster, because those people and others have no other people that no other people have no other people.Related.


```sql
CALL gds.wcc.stream('WCC')
YIELD componentId,nodeId
WITH componentId AS cluster,gds.util.asNode(nodeId) AS client
With cluster, colorct (client.id) as Clients -Collect combined a sequence
WITH *,size(clients) AS clusterSize
WHERE clusterSize>1
Unwind clients as client -unwind to expand a sequence
MATCH(c:Client)
WHERE c.id=client
Set c.firstpartyfraudgroup = cluster;
```


The WCC algorithm helps identify people who need attention, and the next algorithm can continue to be calculated based on the cluster results.


## 5 Summary


This part has completed the reorganization of crowd relations and identified groups with similar characteristics, which is convenient for subsequent analysis.At the same time, commonly used technical points, such as with, Merge, SET, APOC, memory estimation, creating diagrams and running graph algorithms, the next time is explained as a dangerous population for scores to effectively identify fraud criminals.


<figure>
  <img src="https://cdn.jsdelivr.net/gh/BulletTech2021/Pics/2021-6-14/1623639526512-1080P%20(Full%20HD)%20-%20Tail%20Pic.png" width="500" />

</figure>